package com.qianfeng.kaoti2;

public class Test {

	public static void main(String[] args) {
		Company company = new Company(1001,"百度",2000,"李彦宏","全球最大的中文搜索引擎、致力于让网民更便捷地获取信息，找到所求。百度超过千亿的中文网页数据库，可以瞬间找到相关的搜索结果");
		Company company2 = new Company(1010,"腾讯",10000,"马化腾","深圳市腾讯计算机系统有限公司成立于1998年11月，由马化腾、张志东、许晨晔、陈一丹、曾李青五位创始人共同创立。是中国最大的互联网综合服务提供商之一，也是中国服务用户最多的互联网企业之一");
		Company company3 = new Company(1020,"阿里巴巴",20000,"马云","阿里巴巴网络技术有限公司（简称：阿里巴巴集团）是由曾担任英语教师的马云为首的18人，于1999年在中国杭州创立，他们相信互联网能够创造公平的竞争环境，让小企业通过创新与科技扩展业务，并在参与国内或全球市场竞争时处于更有利的位置");
		Company company4 = new Company(1050,"京东",8000,"刘强东","京东（JD.com）是中国最大的自营式电商企业，2015年第一季度在中国自营式B2C电商市场的占有率为56.3%。目前，京东集团旗下设有京东商城、京东金融、拍拍网、京东智能、O2O及海外事业部");
		Company company5 = new Company(1030,"小米",5000,"雷军","小米公司成立于2010年4月，是一家专注于智能产品自主研发的移动互联网公司。’为发烧而生’是小米的产品概念。小米公司首创了用互联网模式开发手机操作系统、发热友参与开发改进的模式");
	}

}
